# Built-in Functions (e.g., Date functions, String functions)
This code snippet demonstrates various built-in functions in SQL for working with dates and strings.

For date functions, it shows how to get the current date, time, and timestamp using `CURRENT_DATE`, `CURRENT_TIME`, and `CURRENT_TIMESTAMP` respectively. It also demonstrates extracting year, month, and day from a date using `EXTRACT`, calculating the difference between two dates using `DATEDIFF`, and formatting dates using `TO_CHAR`.

For string functions, it shows how to get the length of a string using `LENGTH`, convert a string to uppercase or lowercase using `UPPER` and `LOWER`, concatenate two strings using `CONCAT`, replace a substring in a string using `REPLACE`, trim leading and trailing spaces from a string using `TRIM`, get the position of a substring in a string using `POSITION`, repeat a string a specified number of times using `REPEAT`, and reverse a string using `REVERSE`. It also demonstrates converting a string to a date or timestamp using `TO_DATE` and `TO_TIMESTAMP`.

These functions can be useful for manipulating and formatting dates and strings in SQL queries.
#####

In [ ]:
-- Example of using built-in date functions in SQL

-- Create a table to store employee information
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    hire_date DATE
);

-- Insert some sample data
INSERT INTO employees (id, name, hire_date)
VALUES (1, 'John Doe', '2020-01-01'),
       (2, 'Jane Smith', '2019-05-15'),
       (3, 'Mike Johnson', '2021-03-10');

-- Get the current date
SELECT CURRENT_DATE; -- Expected output: current date in YYYY-MM-DD format

-- Get the current time
SELECT CURRENT_TIME; -- Expected output: current time in HH:MM:SS format

-- Get the current timestamp
SELECT CURRENT_TIMESTAMP; -- Expected output: current timestamp in YYYY-MM-DD HH:MM:SS format

-- Extract year from a date
SELECT EXTRACT(YEAR FROM hire_date) AS hire_year
FROM employees; -- Expected output: hire_year column with the year of each employee's hire date

-- Extract month from a date
SELECT EXTRACT(MONTH FROM hire_date) AS hire_month
FROM employees; -- Expected output: hire_month column with the month of each employee's hire date

-- Extract day from a date
SELECT EXTRACT(DAY FROM hire_date) AS hire_day
FROM employees; -- Expected output: hire_day column with the day of each employee's hire date

-- Calculate the difference between two dates
SELECT DATEDIFF('2021-12-31', '2020-01-01') AS date_diff; -- Expected output: 729 (number of days between the two dates)

-- Format a date as a string
SELECT TO_CHAR(hire_date, 'Month DD, YYYY') AS formatted_date
FROM employees; -- Expected output: formatted_date column with hire dates in Month DD, YYYY format

-- Get the current date and time in a specific format
SELECT TO_CHAR(CURRENT_TIMESTAMP, 'YYYY-MM-DD HH24:MI:SS') AS formatted_datetime; -- Expected output: current date and time in YYYY-MM-DD HH:MI:SS format

-- Get the day of the week for a given date
SELECT TO_CHAR(hire_date, 'Day') AS day_of_week
FROM employees; -- Expected output: day_of_week column with the day of the week for each employee's hire date

-- Get the length of a string
SELECT LENGTH('Hello, World!') AS string_length; -- Expected output: 13 (number of characters in the string)

-- Convert a string to uppercase
SELECT UPPER('hello') AS uppercase_string; -- Expected output: "HELLO"

-- Convert a string to lowercase
SELECT LOWER('WORLD') AS lowercase_string; -- Expected output: "world"

-- Concatenate two strings
SELECT CONCAT('Hello', ' ', 'World') AS concatenated_string; -- Expected output: "Hello World"

-- Replace a substring in a string
SELECT REPLACE('Hello, World!', 'World', 'SQL') AS replaced_string; -- Expected output: "Hello, SQL!"

-- Trim leading and trailing spaces from a string
SELECT TRIM('   Hello, World!   ') AS trimmed_string; -- Expected output: "Hello, World!"

-- Get the position of a substring in a string
SELECT POSITION('World' IN 'Hello, World!') AS substring_position; -- Expected output: 8 (position of "World" in the string)

-- Repeat a string a specified number of times
SELECT REPEAT('SQL ', 3) AS repeated_string; -- Expected output: "SQL SQL SQL "

-- Reverse a string
SELECT REVERSE('Hello, World!') AS reversed_string; -- Expected output: "!dlroW ,olleH"

-- Convert a string to a date
SELECT TO_DATE('2022-01-01', 'YYYY-MM-DD') AS converted_date; -- Expected output: 2022-01-01 (date in YYYY-MM-DD format)

-- Convert a string to a timestamp
SELECT TO_TIMESTAMP('2022-01-01 12:34:56', 'YYYY-MM-DD HH24:MI:SS') AS converted_timestamp; -- Expected output: 2022-01-01 12:34:56 (timestamp in YYYY-MM-DD HH:MI:SS format)

-- Drop the table
DROP TABLE employees;

# User-defined Functions
Explanation:
In this code snippet, we demonstrate the usage of user-defined functions in SQL. We create a table called "employees" with columns for id, name, and salary. Then, we define a user-defined function called "calculate_bonus" that takes the salary as input and returns the bonus amount based on the salary.

Inside the function, we declare a local variable "bonus" to store the calculated bonus. We use an IF statement to determine the bonus amount based on the salary. If the salary is greater than 5000, the bonus is set to 10% of the salary. Otherwise, the bonus is set to 5% of the salary.

After creating the function, we insert some sample data into the "employees" table. Finally, we call the user-defined function for each employee and print their name, salary, and bonus amount using a SELECT statement.

Expected output:
```
+--------------+--------+--------+
| name         | salary | bonus  |
+--------------+--------+--------+
| John Doe     | 6000   | 600.00 |
| Jane Smith   | 4000   | 200.00 |
| Mike Johnson | 8000   | 800.00 |
+--------------+--------+--------+
```

In [ ]:
-- Create a sample table
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    salary DECIMAL(10, 2)
);

-- Create a user-defined function to calculate the bonus based on salary
CREATE FUNCTION calculate_bonus(salary DECIMAL(10, 2))
RETURNS DECIMAL(10, 2)
BEGIN
    DECLARE bonus DECIMAL(10, 2);
    
    -- Calculate the bonus based on salary
    IF salary > 5000 THEN
        SET bonus = salary * 0.1;
    ELSE
        SET bonus = salary * 0.05;
    END IF;
    
    RETURN bonus;
END;

-- Insert some sample data
INSERT INTO employees (id, name, salary)
VALUES (1, 'John Doe', 6000),
       (2, 'Jane Smith', 4000),
       (3, 'Mike Johnson', 8000);

-- Call the user-defined function for each employee and print the bonus
SELECT name, salary, calculate_bonus(salary) AS bonus
FROM employees;

# Sequences (for generating unique numbers)
Explanation:
In SQL, sequences are used to generate unique numbers. They are often used to generate primary key values for tables. The code snippet demonstrates various aspects of working with sequences.

- The first step is to create a sequence using the `CREATE SEQUENCE` statement. In this case, a sequence named `my_sequence` is created without any parameters.
- To get the next value from the sequence, the `NEXTVAL` function is used. It returns the next value in the sequence. In the example, `NEXTVAL('my_sequence')` is used, which will return `1` as the initial value.
- Sequences can also be created with parameters such as initial value and increment. The `CREATE SEQUENCE` statement can be used with the `START WITH` and `INCREMENT BY` clauses to specify these parameters. In the code snippet, a sequence named `my_sequence_with_params` is created with an initial value of `100` and an increment of `10`.
- The `NEXTVAL` function can be used with sequences that have parameters as well. In the example, `NEXTVAL('my_sequence_with_params')` is used to get the next value from the sequence, which will be `100` initially and `110` in the subsequent call.
- The `SETVAL` function is used to set the current value of a sequence. In the code snippet, `SETVAL('my_sequence_with_params', 200)` is used to set the current value of `my_sequence_with_params` to `200`.
- The `CURRVAL` function is used to get the current value of a sequence. In the example, `CURRVAL('my_sequence_with_params')` is used to retrieve the current value, which will be `210` after setting it using `SETVAL`.
- Sequences can be restarted using the `RESTART IDENTITY` clause. In the code snippet, `RESTART IDENTITY('my_sequence_with_params')` is used to restart the sequence `my_sequence_with_params`.
- After restarting the sequence, the `NEXTVAL` function is used again to get the next value, which will be `100` as specified by the `START WITH` clause.
- Finally, the sequence can be dropped using the `DROP SEQUENCE` statement. In the example, `DROP SEQUENCE my_sequence_with_params` is used to remove the sequence `my_sequence_with_params` from the database.

Sequences are a powerful feature in SQL that provide an easy way to generate unique numbers for various purposes, especially when generating primary key values for tables.

In [ ]:
-- Create a sequence
CREATE SEQUENCE my_sequence;

-- Get the next value from the sequence
SELECT NEXTVAL('my_sequence'); -- Expected output: 1

-- Create a sequence with initial value and increment
CREATE SEQUENCE my_sequence_with_params
    START WITH 100
    INCREMENT BY 10;

-- Get the next value from the sequence with parameters
SELECT NEXTVAL('my_sequence_with_params'); -- Expected output: 100
SELECT NEXTVAL('my_sequence_with_params'); -- Expected output: 110

-- Set the current value of the sequence
SELECT SETVAL('my_sequence_with_params', 200);

-- Get the next value after setting the current value
SELECT NEXTVAL('my_sequence_with_params'); -- Expected output: 210

-- Get the current value of the sequence
SELECT CURRVAL('my_sequence_with_params'); -- Expected output: 210

-- Restart the sequence
SELECT RESTART IDENTITY('my_sequence_with_params');

-- Get the next value after restarting the sequence
SELECT NEXTVAL('my_sequence_with_params'); -- Expected output: 100

-- Drop the sequence
DROP SEQUENCE my_sequence_with_params;